app/views/orders/_form.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = 219 LIMIT 1
---
<!-- START_HIGHLIGHT -->
      <h2><%= t('errors.template.header', :count=>@order.errors.size,
        :model=>t('activerecord.models.order')) %>.</h2>