app/controllers/carts_controller.rb

INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2011-07-18 15:18:24.406996', '2011-07-18 15:18:24.406996')
---
  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save