app/controllers/comments_controller.rb

INSERT INTO "comments" ("updated_at", "content", "product_id", "created_at") VALUES ('2011-08-09 07:34:12.609375', 'I don''t know...', NULL, '2011-08-09 07:34:12.609375')
---
  def create

    @comment = Comment.new(params[:comment])
    #@comment.product_id = params[:product_id]

    respond_to do |format|
      if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = 980190962 LIMIT 1
---
  def update
    @comment = Comment.find(params[:id])