app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = 2 ORDER BY title LIMIT 1
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2011-07-18 15:15:31.129592', '2011-07-18 15:15:31.129592')
INSERT INTO "line_items" ("updated_at", "order_id", "cart_id", "quantity", "product_id", "created_at") VALUES ('2011-08-03 03:03:33.156250', NULL, 980190963, 1, 207281424, '2011-08-03 03:03:33.156250')
UPDATE "line_items" SET "updated_at" = '2011-07-20 03:36:28.171464', "quantity" = 2 WHERE "line_items"."id" = 11
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save