app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."id" = 1 LIMIT 1
---
  def edit
    @message = Message.find(params[:id])

INSERT INTO "messages" ("updated_at", "created_at", "title") VALUES ('2011-08-09 06:04:14.285299', '2011-08-09 06:04:14.285299', '兄弟们，加油~')
---
  def create
    @message = Message.new(params[:message])

    respond_to do |format|
      if @message.save

SELECT "messages".* FROM "messages" WHERE "messages"."id" = 1 LIMIT 1
UPDATE "messages" SET "updated_at" = '2011-08-09 06:04:28.019026', "title" = '巫罡是傻B！' WHERE "messages"."id" = 1
---
  def update
    @message = Message.find(params[:id])

    respond_to do |format|
      if @message.update_attributes(params[:message])