app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders"
---
  def index
    #@orders = Order.all
    @orders = Order.paginate :page=>params[:page], :order=>'created_at desc', :per_page=>10

SELECT "line_items".* FROM "line_items" WHERE ("line_items".cart_id = 80)
SELECT COUNT(*) FROM "line_items" WHERE ("line_items".cart_id = 37)
---
  def new
    if current_cart.line_items.empty?

INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2011-08-03 03:03:34.875000', '2011-08-03 03:03:34.875000')
INSERT INTO "orders" ("address", "created_at", "email", "updated_at", "name", "pay_type") VALUES ('中山大学东校区至善园2号', '2011-08-10 02:57:21.903150', '598514993@qq.com', '2011-08-10 02:57:21.903150', 'zhaozhilong', 'Purchase order')
DELETE FROM "carts" WHERE "carts"."id" = 37
SELECT "line_items".* FROM "line_items" WHERE ("line_items".order_id = 980190963)
---
  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
        session[:cart_id] = nil
        Notifier.order_received(@order).deliver