app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos" WHERE "photos"."id" = 980190962 LIMIT 1
---
  def edit
    @photo = Photo.find(params[:id])

INSERT INTO "photos" ("url", "updated_at", "created_at", "name") VALUES ('/uploads/20110812095700_20110811141113_6.jpg', '2011-08-12 01:57:00.196143', '2011-08-12 01:57:00.196143', '20110812095700_20110811141113_6.jpg')
---
 def create
     @photo = Photo.new(params[:photos])
    @filename=save_file   #调用save_file方法，返回文件名
     @photo.url="/uploads/#{@filename}"   #保存文件路径字段
     @photo.name=@filename
     if @photo.save

SELECT "photos".* FROM "photos" WHERE "photos"."id" = 980190962 LIMIT 1
---
  def update
    @photo = Photo.find(params[:id])