app/controllers/products_controller.rb

INSERT INTO "products" ("mark", "created_at", "title", "updated_at", "image_url", "price", "description") VALUES (75, '2011-08-12 01:52:54.251794', 'web-design', '2011-08-12 01:52:54.251794', '/uploads/20110812095254_wd4d.jpg', 54.0, 'Web Design and HTML are all about creating a great Web site. Use Web development and Web site design to build Web sites that customers return...')
---
  def create
     @product = Product.new(params[:products])
    @filename=save_file   #调用save_file方法，返回文件名
     @product.image_url="/uploads/#{@filename}"   #保存文件路径字段
     @product.title=params[:product][:title]
    @product.description=params[:product][:description]
    @product.price=params[:product][:price]
    @product.mark=params[:product][:mark]
     if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = 5 ORDER BY title LIMIT 1
UPDATE "products" SET "updated_at" = '2011-08-11 09:13:10.703125', "price" = 19.95, "description" = 'Wibbles are fun!', "image_url" = 'lorem.jpg', "title" = 'Lorem Ipsum' WHERE "products"."id" = 980190962
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT "products".* FROM "products" WHERE "products"."id" = 4 ORDER BY title LIMIT 1
DELETE FROM "products" WHERE "products"."id" = 4
---
  def destroy
    @product = Product.find(params[:id])
    @product.delete

SELECT "products".* FROM "products" WHERE "products"."id" = 3 ORDER BY title LIMIT 1
---
def who_bought
    @product = Product.find(params[:id])