app/controllers/questions_controller.rb

  def create
    @question = Question.new(params[:question])

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("updated_at", "title", "reply", "created_at", "content") VALUES ('2011-08-11 02:50:45.390625', 'ask something', NULL, '2011-08-11 02:50:45.390625', '??????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????')

  def update
    @question = Question.find(params[:id])

    respond_to do |format|
      if @question.update_attributes(params[:question])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = 2 LIMIT 1
UPDATE "questions" SET "content" = '?????????????????????????????????????????????????????????????????? ????????????????????????????????????????????????????????????????????????????????????????????????????????????', "updated_at" = '2011-08-11 05:56:00.593750' WHERE "questions"."id" = 2