app/controllers/store_controller.rb

  def index
     @recphoto = Photo.selectphoto
    if params[:set_locale]
      redirect_to store_path(:locale => params[:set_locale])
    end
  else
    @products = Product.all
---
SELECT "products".* FROM "products" ORDER BY title