app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("hashed_password", "name", "updated_at", "salt", "created_at") VALUES ('28a6ca1654f8ffdc2785afa1cbfdf96cdb31f0ed124e43aaf3359b8692f3ddf6', 'zhaozhilong', '2011-08-01 02:19:00.801419', '654086280.521458900836417', '2011-08-01 02:19:00.801419')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 980190962 LIMIT 1
UPDATE "users" SET "updated_at" = '2011-08-12 02:43:01.136100', "hashed_password" = 'fa4d7f08c66f954946ab8e54c4ddfe16db08ecb2eceb6de24f20f66fce3988d0', "name" = 'sam', "salt" = '506901720.423962602275488' WHERE "users"."id" = 980190962